import pandas as pd
import pytest


@pytest.fixture
def transactions_df():
    return pd.DataFrame([
        {
            "Дата операции": "02.12.2021 14:41:17",
            "Дата платежа": "02.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -15.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -15.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Связь",
            "MCC": 7379.0,
            "Описание": "Devajs Servis.",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 15.0
        },
    ])


@pytest.fixture
def top_transactions_df():
    return pd.DataFrame([
        {
            "Дата операции": "02.12.2021 14:41:17",
            "Дата платежа": "02.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -15.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -15.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Связь",
            "MCC": 7379.0,
            "Описание": "Devajs Servis.",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 15.0
        },
        {
            "Дата операции": "02.12.2021 16:26:02",
            "Дата платежа": "02.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -5510.8,
            "Валюта операции": "RUB",
            "Сумма платежа": -5510.8,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Каршеринг",
            "MCC": 7379.0,
            "Описание": "Ситидрайв",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 15.0
        },
        {
            "Дата операции": "02.12.2021 15:18:26",
            "Дата платежа": "02.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -496.51,
            "Валюта операции": "RUB",
            "Сумма платежа": -496.51,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Супермаркеты",
            "MCC": 7379.0,
            "Описание": "Магнит",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 15.0
        },
        {
            "Дата операции": "02.12.2021 14:40:46",
            "Дата платежа": "02.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -300.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -300.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Местный транспорт",
            "MCC": 7379.0,
            "Описание": "Метро Санкт-Петербург",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 15.0
        },
        {
            "Дата операции": "02.12.2021 19:48:21",
            "Дата платежа": "02.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -200.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -200.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Местный транспорт",
            "MCC": 7379.0,
            "Описание": "Метро Санкт-Петербург",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 15.0
        }
    ])


@pytest.fixture
def top_transactions_list():
    return ([
        {
            "Дата операции": "16.01.2018 20:06:27",
            "Дата платежа": "17.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -250.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -250.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Связь",
            "MCC": 4814.0,
            "Описание": "МТС",
            "Бонусы (включая кэшбэк)": 5,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 250.0
        },
        {
            "Дата операции": "02.12.2021 16:26:02",
            "Дата платежа": "02.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -5510.8,
            "Валюта операции": "RUB",
            "Сумма платежа": -5510.8,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Каршеринг",
            "MCC": 7379.0,
            "Описание": "Тинькофф Мобайл +7 995 555-55-55",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 15.0
        },
        {
            "Дата операции": "02.12.2021 16:26:02",
            "Дата платежа": "02.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -5510.8,
            "Валюта операции": "RUB",
            "Сумма платежа": -5510.8,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Переводы",
            "MCC": 7379.0,
            "Описание": "Азер Г.",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 15.0
        }
    ])
